driver-tests/bpelse/assign/AssignJbi/test/echoGMonthDayDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoGMonthDayDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoGMonthDayDataType">
    <string>--10-27</string>
    <normalizedString>--10-27</normalizedString>
    <token>--10-27</token>
    <base64Binary>--10-27</base64Binary>
    <hexBinary>--10-27</hexBinary>
    <integer>--10-27</integer>
    <positiveInteger>--10-27</positiveInteger>
    <negativeInteger>--10-27</negativeInteger>
    <nonNegativeInteger>--10-27</nonNegativeInteger>
    <nonPositiveInteger>--10-27</nonPositiveInteger>
    <long>--10-27</long>
    <unsignedLong>--10-27</unsignedLong>
    <int>--10-27</int>
    <unsignedInt>--10-27</unsignedInt>
    <short>--10-27</short>
    <unsignedShort>--10-27</unsignedShort>
    <byte>--10-27</byte>
    <unsignedByte>--10-27</unsignedByte>
    <decimal>--10-27</decimal>
    <float>--10-27</float>
    <double>--10-27</double>
    <boolean>--10-27</boolean>
    <duration>--10-27</duration>
    <dateTime>--10-27</dateTime>
    <date>--10-27</date>
    <time>--10-27</time>
    <gYear>--10-27</gYear>
    <gYearMonth>--10-27</gYearMonth>
    <gMonth>--10-27</gMonth>
    <gMonthDay>--10-27</gMonthDay>
    <gDay>--10-27</gDay>
    <Name>--10-27</Name>
    <QName>--10-27</QName>
    <NCName>--10-27</NCName>
    <anyURI>--10-27</anyURI>
    <language>--10-27</language>
    <ID>--10-27</ID>
    <IDREF>--10-27</IDREF>
    <IDREFS>--10-27</IDREFS>
    <ENTITY>--10-27</ENTITY>
    <ENTITIES>--10-27</ENTITIES>
    <NMTOKEN>--10-27</NMTOKEN>
    <NMTOKENS>--10-27</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
